Documents/Лео_РасчетСебестоимостиПродукции/Лео_РасчетСебестоимостиПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Лео_РасчетСебестоимостиПродукции</name>
  <attributes>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.СпецификацииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПоСпец</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланЦенаМатериалы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланЦенаУпаковка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланЦенаКомплектуюшие</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланЦенаМатЗатраты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПродукцияКоличество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>_НаценкаПартнера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>_ЦенаРЦЦ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>_ЦенаПромоНаПолке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦенНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.Лео_СтатусыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>_НаценкаПартнера1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>_НаценкаПартнера2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>_НаценкаПартнера3</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>_НаценкаПартнера4</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>_НаценкаПартнера5</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>_НаценкаПартнера6</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>_НаценкаПартнера7</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>_НаценкаПартнера8</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>_НаценкаПартнера9</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>_НаценкаПартнера10</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>_НаценкаПартнера11</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>_НаценкаПартнера12</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФОТСуммаПлан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабМатЗатраты</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>9</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидНоменклатуры</name>
      <type>
        <types>CatalogRef.ВидыНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>9</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТабФОТ</name>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Лео_ДолжностиПереработчиков</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>9</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТехКарта</name>
      <type>
        <types>CatalogRef.ТехнологическиеКартыПроизводства</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЗаСмену</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасовВсмене</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧеловекВсмене</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <comment>(Упр)</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Валюта</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмерения</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>ПроцентСкидкиНаценки</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СпособРасчетаЦены</name>
    <type>
      <types>EnumRef.СпособыРасчетаЦены</types>
    </type>
  </resources>
  <dimensions>
    <name>ТипЦен</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ТипыЦенНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

InformationRegisters/Лео_ПартияНоменклатуры/Лео_ПартияНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Лео_ПартияНоменклатуры</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьСНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаСНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерияНоменклатуры</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументОприходования</name>
    <type>
      <types>DocumentRef.ОприходованиеТоваров</types>
      <types>DocumentRef.ОтчетПроизводстваЗаСмену</types>
      <types>DocumentRef.ВозвратМатериаловИзЭксплуатации</types>
      <types>DocumentRef.ПоступлениеТоваровУслугВНТТ</types>
      <types>DocumentRef.ПриходныйОрдерНаТовары</types>
      <types>DocumentRef.ВозвратПереданныхТоваров</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
      <types>DocumentRef.ПринятиеКУчетуОС</types>
      <types>DocumentRef.ПоступлениеТоваровИзПереработки</types>
      <types>DocumentRef.ОприходованиеМатериаловИзПроизводства</types>
      <types>DocumentRef.КомплектацияНоменклатуры</types>
      <types>DocumentRef.АвансовыйОтчет</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПоставщику</name>
    <type>
      <types>DocumentRef.СчетНаОплатуПоставщика</types>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

InformationRegisters/Лео_стоимостьПереработчиков/Лео_стоимостьПереработчиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Лео_стоимостьПереработчиков</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <attributes>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаБезНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Лео_ДолжностиПереработчиков</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Смена</name>
    <type>
      <types>CatalogRef.Лео_сменыПереработчиков</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДолжностьПереработчика</name>
    <type>
      <types>CatalogRef.Лео_ДолжностиПереработчиков</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

InformationRegisters/Лео_ТрудовойКоэффициент/Лео_ТрудовойКоэффициент.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Лео_ТрудовойКоэффициент</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Коэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
</mdclass:InformationRegister>

Documents/Лео_РасчетСебестоимостиПродукции/Forms/ФормаДокумента/Module.bsl
Перем _Количество;


&НаКлиенте
Процедура МатЗатратыЗаполнить(Команда)
	// Вставить содержимое обработчика.
		
	МатЗатратыЗаполнитьСервер();
    	
КонецПроцедуры

	

&НаСервере  
Функция МатЗатратыЗаполнитьСервер()
	
    Об = РеквизитФормыВЗначение("Объект");
	Рез = Об.МатЗатратыЗаполнить();
    Об = Неопределено;             
	
	Рез.Свернуть("ГруппаНоменклатура,Номенклатура,Ценапоследняя,Цена","КоличествоЗаЕд,СуммаПлан");
	
	
	//Рез.Сортировать("ГруппаНоменклатура");
	Объект.ТабМатЗатраты.Очистить();
	Рез.Колонки.Добавить("ПолеСортировки");
	Для каждого тт из Рез цикл
		Если СокрЛП(тт.ГруппаНоменклатура) = "Материал" тогда
			тт.ПолеСортировки = 0;
		ИначеЕсли СокрЛП(тт.ГруппаНоменклатура) = "Упаковка" тогда	
			тт.ПолеСортировки = 1;
		Иначе
			тт.ПолеСортировки = 2;
		КонецЕсли;
		
	КонецЦикла;
	
	Рез.Сортировать("ПолеСортировки");
	
	
	Для каждого сс из Рез цикл
		
		тт = Объект.ТабМатЗатраты.Добавить(); 
		тт.Номенклатура 	= сс.Номенклатура;
		тт.ВидНоменклатуры 	= сс.ГруппаНоменклатура;
		тт.Количество 		= сс.КоличествоЗаЕд;
		тт.ЦенаПлан 		= сс.Цена;
		тт.ЦенаФакт 		= сс.Ценапоследняя;
		тт.СуммаПлан 		= сс.СуммаПлан;
	КонецЦикла;
	
	ИтогПоВиду = Рез.Скопировать();
	ИтогПоВиду.Свернуть("ГруппаНоменклатура","СуммаПлан");
	
	Объект.ПланЦенаМатериалы = 0;
	Объект.ПланЦенаУпаковка = 0;
	Объект.ПланЦенаКомплектуюшие = 0;
	
	
	Итог = 0;
	Если ИтогПоВиду.Количество() > 0 тогда
		Для каждого сс из ИтогПоВиду цикл
			Если СокрЛП(сс.ГруппаНоменклатура) = "Материал" тогда
				Объект.ПланЦенаМатериалы = Объект.ПланЦенаМатериалы + сс.СуммаПлан;
			иначеЕсли СокрЛП(сс.ГруппаНоменклатура) = "Упаковка" тогда
				Объект.ПланЦенаУпаковка = Объект.ПланЦенаУпаковка + сс.СуммаПлан;
			иначе
				Объект.ПланЦенаКомплектуюшие = Объект.ПланЦенаКомплектуюшие + сс.СуммаПлан;
			КонецЕсли;
			Итог = Итог + сс.СуммаПлан; 
		КонецЦикла;
		Объект.ПланЦенаМатЗатраты = Итог;
	КонецЕсли;
	
КонецФункции

//&НаСервере
//Функция МатЗатратыЗаполнитьСервер()
//	
//	
//	ТЗ_ИсходныеКомп_РЕЗ = неопределено;
//	
//	//сч = сч + 1;
//	
//	//Основная = 1;
//	Основная = 0; //Плановая
//	
//	
//	Спецификация = Объект.Спецификация;
//	Номенклатура = Объект.Продукция;
//	ДатаПланирования = КонецДня(Объект.Дата);
//	Количество = Объект.КоличествоПоСпец;
//	_ДатаКон = ДатаПланирования;
//	
//	
//	
//	
//	//Количество = ВыборкаДетальныеЗаписи.Количество;
//	//Спецификация = ВыборкаДетальныеЗаписи.Спецификация;
//	
//	
//	////+ Количество уровней разузлования
//	_СтруктураР = абс_Дистрибуция.Лео_РазузловатьНоменклатуру(Спецификация,Количество,1,Основная,ДатаПланирования);
//	ТЗ_ИсходныеКомплектующие = _СтруктураР.ИсходныеКомплектующие;
//	
//	Если ТЗ_ИсходныеКомп_РЕЗ = неопределено тогда
//		ТЗ_ИсходныеКомп_РЕЗ = ТЗ_ИсходныеКомплектующие.Скопировать();
//		ТЗ_ИсходныеКомп_РЕЗ.Очистить();
//		ТЗ_ИсходныеКомп_РЕЗ.колонки.Добавить("Продукция");
//		ТЗ_ИсходныеКомп_РЕЗ.колонки.Добавить("ПродукцияКоличество");
//		
//	КонецЕсли;
//	////- Количество уровней разузлования
//	
//	
//	УровеньРазузлования = абс_Дистрибуция.Лео_ПолучитьКоличествоУровнейРазузлования(Спецификация,Количество,Основная,ДатаПланирования);
//	УровеньРазузлования = УровеньРазузлования + 5; //костыль надо поправить
//	_СтруктураР = абс_Дистрибуция.Лео_РазузловатьНоменклатуру(Спецификация,Количество,УровеньРазузлования,Основная,ДатаПланирования);
//	
//	Для каждого стр из _СтруктураР.ИсходныеКомплектующие цикл
//		Если стр.Разузлован тогда
//			
//			//Если стр.Номенклатура.ВидНоменклатуры.Наименование = "Работа" тогда
//			//	продолжить;
//			//КонецЕсли;	
//			
//			сс = ТЗ_ИсходныеКомп_РЕЗ.Добавить();
//			ЗаполнитьЗначенияСвойств(сс,стр);
//			сс.Продукция = Номенклатура;
//			сс.ПродукцияКоличество = Количество;
//			сс.Спецификация = Спецификация;
//		КонецЕсли;
//	КонецЦикла;
//	
//	//	ОбработкаПрерыванияПользователя();
//	
//	//	Состояние("обработано: " + сокрлп(сч) + " из " + сокрлп(кКол)); 
//	
//	//КонецЦикла;
//	
//	
//	
//	
//	Если ТЗ_ИсходныеКомп_РЕЗ = неопределено тогда
//		Сообщить("Не найдены спецификации для указанной продукции !");
//		
//	иначе	
//		
//		ТЗ_Прод = ТЗ_ИсходныеКомп_РЕЗ.Скопировать();
//		//ТЗ_Прод.Свернуть("Спецификация,Номенклатура,Продукция,ПродукцияКоличество,Количество");
//		ТЗ_Прод.Свернуть("Спецификация,Номенклатура,Продукция,ПродукцияКоличество","Количество");

//		
//		ТЗ_Прод.Колонки.Добавить("ПродукцияАртикул");
//		ТЗ_Прод.Колонки.Добавить("НоменклатураАртикул");
//		ТЗ_Прод.Колонки.Добавить("КоличествоЗаЕд");
//		ТЗ_Прод.Колонки.Добавить("Цена");
//		ТЗ_Прод.Колонки.Добавить("Ценапоследняя");
//		
//		ТЗ_Прод.Колонки.Добавить("ГруппаПродукция");
//		ТЗ_Прод.Колонки.Добавить("ГруппаНоменклатура");
//		ТЗ_Прод.Колонки.Добавить("СуммаПлан");
//		
//		
//		
//		Для каждого сс из ТЗ_Прод цикл 
//			
//			
//			
//			сс.ПродукцияАртикул    = сс.Продукция.Артикул;
//			сс.НоменклатураАртикул = сс.Номенклатура.Артикул;
//			
//			//ДатаПредыдущегоМесяца = КонецМесяца(ДобавитьМесяц(_ДатаКон,-1));
//			//сс.Цена = РегистрыСведений.Лео_ПартияНоменклатуры.ПолучитьПоследнее(ДатаПредыдущегоМесяца,Новый Структура("Номенклатура",сс.Номенклатура)).Цена; 
//			
//			//Если сс.Цена = 0 тогда
//			сс.Цена = _ПолучитьЦенуПоПрайсуЛеоНастройки(КонецДня(_ДатаКон),сс.Номенклатура);
//			//Конецесли;
//			
//			сс.ЦенаПоследняя=получитьпоследнююцену(сс.Номенклатура,КонецДня(_ДатаКон));
//			
//			
//			Если сс.ПродукцияКоличество > 0 тогда
//				сс.КоличествоЗаЕд = сс.Количество/сс.ПродукцияКоличество;
//			КонецЕсли;
//			
//			сс.ГруппаПродукция       = сс.Продукция.ВидНоменклатуры;
//			сс.ГруппаНоменклатура    = сс.Номенклатура.ВидНоменклатуры;
//			
//			
//			сс.СуммаПлан = сс.Цена * сс.КоличествоЗаЕд;
//			
//			Объект.ПродукцияКоличество = сс.ПродукцияКоличество;
//		КонецЦикла;
//		
//		
//	Конецесли;	
//	
//	
//	возврат ТЗ_Прод;
//	
//	
//КонецФункции	


Функция _ПолучитьЦенуПоПрайсуЛеоНастройки(ДатаКон,_Номенклатура) 
	
	_Цена = 0;
	
	_ТипЦен = Объект.ТипЦен;
	Если НЕ _ТипЦен.Пустая() тогда
		//_ТипЦен = _ТипЦен._Ссылка;
		  сПараметров = РегистрыСведений.ЦеныНоменклатуры.ПолучитьПоследнее(ДатаКон,Новый Структура("ТипЦен,Номенклатура",_ТипЦен,_Номенклатура));
		
		  _Цена = сПараметров.Цена;
		
	КонецЕсли;	  
	
	Возврат _Цена;
	
КонецФункции


Функция ПолучитьПоследнююЦену(ссноменклатура,_ДатаКон)
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(Лео_ПартияНоменклатурыСрезПоследних.ДокументОприходования) КАК ДокументОприходования,
	|	Лео_ПартияНоменклатурыСрезПоследних.Цена,
	|	Лео_ПартияНоменклатурыСрезПоследних.ЦенаСНДС,
	|	Лео_ПартияНоменклатурыСрезПоследних.Номенклатура.Артикул КАК Артикул
	|ИЗ
	|	(ВЫБРАТЬ
	|		Лео_ПартияНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|		МАКСИМУМ(Лео_ПартияНоменклатурыСрезПоследних.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.Лео_ПартияНоменклатуры.СрезПоследних(&дата, ) КАК Лео_ПартияНоменклатурыСрезПоследних
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Лео_ПартияНоменклатурыСрезПоследних.Номенклатура) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Лео_ПартияНоменклатуры.СрезПоследних КАК Лео_ПартияНоменклатурыСрезПоследних
	|		ПО ВложенныйЗапрос.Номенклатура = Лео_ПартияНоменклатурыСрезПоследних.Номенклатура
	|			И ВложенныйЗапрос.Период = Лео_ПартияНоменклатурыСрезПоследних.Период
	|ГДЕ
	|	ВложенныйЗапрос.Номенклатура = &ссноменклатура
	|	И Лео_ПартияНоменклатурыСрезПоследних.Номенклатура = &ссноменклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Номенклатура,
	|	Лео_ПартияНоменклатурыСрезПоследних.Цена,
	|	Лео_ПартияНоменклатурыСрезПоследних.ЦенаСНДС,
	|	Лео_ПартияНоменклатурыСрезПоследних.Номенклатура.Артикул
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура,
	|	ДокументОприходования";
	
	Запрос.УстановитьПараметр("дата", _ДатаКон);
	Запрос.УстановитьПараметр("ссноменклатура", ссноменклатура);
	
	Результат = Запрос.Выполнить();
	результаткк=0;
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		результаткк	= ВыборкаДетальныеЗаписи.Цена;
		
		
	КонецЦикла;
	//сообщить("**************");
	//сообщить(ссноменклатура);
	//сообщить(_ДатаКон);
	//сообщить(результат);
	
	Возврат результаткк;
	
	//  Возврат 1;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	
	
КонецФункции


//&НаКлиенте
//Функция ПолучитьАктуальнуюСпецификацию()
//	
//	ТЗспец = ПолучитьСпецификации();	
//    Объект.Спецификация = Справочники.СпецификацииНоменклатуры.ПустаяСсылка();
//	Объект.КоличествоПоСпец   = 0;

//	Если ТЗспец.Количество() > 0 тогда
//		
//		мПоиПл  = ТЗспец.НайтиСтроки(Новый Структура("Номенклатура,Признак",Объект.Продукция,0));
//		мПоиОсн = ТЗспец.НайтиСтроки(Новый Структура("Номенклатура,Признак",Объект.Продукция,1));
//		
//		Если мПоиПл.Количество() > 0 тогда
//			Объект.Спецификация = мПоиПл[0].СпецификацияПлан;
//			Объект.КоличествоПоСпец   = мПоиПл[0].КоличествоПлан;
//		иначе
//			Объект.Спецификация = мПоиОсн[0].СпецификацияОсн;
//			Объект.КоличествоПоСпец   = мПоиОсн[0].Количество;
//		КонецЕсли;	
//		
//	КонецЕсли;	
//	Возврат ТЗспец;
//КонецФункции   

&НаСервере
Функция ПолучитьАктуальнуюСпецификациюСервер() Экспорт 
    ЭтотОбъект = РеквизитФормыВЗначение("Объект");
    Рез = ЭтотОбъект.ПолучитьАктуальнуюСпецификацию();     
	ЗначениеВРеквизитФормы(ЭтотОбъект,"Объект");
 
	Возврат Рез;
КонецФункции



//&НаКлиенте
//Функция ПолучитьСпецификации()
//	
//	Текст = 
//	
//	"ВЫБРАТЬ
//	|	ОсновныеСпецификацииНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
//	|	ОсновныеСпецификацииНоменклатурыСрезПоследних.СпецификацияНоменклатуры КАК СпецификацияОсн,
//	|	СпецификацииНоменклатурыВыходныеИзделия.Количество,
//	|	NULL КАК СпецификацияПлан,
//	|	0 КАК КоличествоПлан,
//	|	1 КАК Признак
//	|ПОМЕСТИТЬ ТЗ
//	|ИЗ
//	|	РегистрСведений.ОсновныеСпецификацииНоменклатуры.СрезПоследних(&_ДатаКон, ) КАК ОсновныеСпецификацииНоменклатурыСрезПоследних
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СпецификацииНоменклатуры.ВыходныеИзделия КАК СпецификацииНоменклатурыВыходныеИзделия
//	|		ПО ОсновныеСпецификацииНоменклатурыСрезПоследних.Номенклатура = СпецификацииНоменклатурыВыходныеИзделия.Номенклатура
//	|			И ОсновныеСпецификацииНоменклатурыСрезПоследних.СпецификацияНоменклатуры = СпецификацииНоменклатурыВыходныеИзделия.Ссылка
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	Лео_ПлановыеСпецификацииНоменклатурыСрезПоследних.Номенклатура,
//	|	NULL,
//	|	0,
//	|	Лео_ПлановыеСпецификацииНоменклатурыСрезПоследних.СпецификацияНоменклатуры,
//	|	СпецификацииНоменклатурыВыходныеИзделия.Количество,
//	|	0
//	|ИЗ
//	|	РегистрСведений.Лео_ПлановыеСпецификацииНоменклатуры.СрезПоследних(&_ДатаКон, ) КАК Лео_ПлановыеСпецификацииНоменклатурыСрезПоследних
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СпецификацииНоменклатуры.ВыходныеИзделия КАК СпецификацииНоменклатурыВыходныеИзделия
//	|		ПО Лео_ПлановыеСпецификацииНоменклатурыСрезПоследних.Номенклатура = СпецификацииНоменклатурыВыходныеИзделия.Номенклатура
//	|			И Лео_ПлановыеСпецификацииНоменклатурыСрезПоследних.СпецификацияНоменклатуры = СпецификацииНоменклатурыВыходныеИзделия.Ссылка
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ТЗ.Номенклатура КАК Номенклатура,
//	|	ТЗ.СпецификацияОсн,
//	|	ТЗ.Количество,
//	|	ТЗ.СпецификацияПлан,
//	|	ТЗ.КоличествоПлан,
//	|	ТЗ.Признак
//	|ИЗ
//	|	ТЗ КАК ТЗ
//	|ГДЕ
//	|	1 = 1"
//	;		
//	
//	
//	//Если ЗначениеЗаполнено(ВидНоменклатуры) тогда
//	//	Текст = Текст + "
//	//	|	 И ТЗ.Номенклатура.ВидНоменклатуры В (&ВидНоменклатуры)";
//	//КонецЕсли;
//	//
//	//Если ЗначениеЗаполнено(_Продукция) и _ПродукцияИспользование тогда
//	Текст = Текст + "
//	|	 И ТЗ.Номенклатура В (&_Продукция)";
//	//КонецЕсли;
//	
//	
//	Запрос = Новый Запрос;	
//	Запрос.Текст = Текст;
//	Запрос.УстановитьПараметр("Состояние", Перечисления.СостоянияОбъектов.Утвержден);
//	//Запрос.УстановитьПараметр("ВидНоменклатуры", ВидНоменклатуры);
//	Запрос.УстановитьПараметр("_Продукция", Объект.Продукция);
//	Запрос.УстановитьПараметр("_ДатаКон", КонецДня(Объект.Дата));
//	
//	Результат = Запрос.Выполнить();
//	
//	возврат Результат.Выгрузить();
//	
//	
//	
//КонецФункции

&НаКлиенте
Процедура ТрудозатратыЗаполнить(Команда)
	// Вставить содержимое обработчика.
	
	Рез = ТрудозатратыЗаполнитьСервер();
	
	Объект.ТабФОТ.Очистить();
	
	Для каждого сс из Рез цикл
		
		тт = Объект.ТабФОТ.Добавить(); 
		тт.Должность 	= сс.Должность;
		тт.Количество 	= сс.Количество;
		//тт.Цена 		= сс.КоличествоЗаЕд;
		тт.Цена 		= сс.Цена;
		//тт.ЦенаФакт 		= сс.Ценапоследняя;
		тт.СуммаПлан 		= сс.Количество * сс.Цена * сс.ЧасовВсмене;
		тт.ТехКарта     = сс.ТехКарта;
		
		тт.КоличествоЗаСмену    = сс.КоличествоЗаСмену;
		тт.ЧасовВсмене          = сс.ЧасовВсмене;
		тт.ЧеловекВсмене        = сс.ЧеловекВсмене;
		
		
	КонецЦикла;
	
	
КонецПроцедуры


Функция ТрудозатратыЗаполнитьСервер()
	
	ТЗ_ИсходныеКомп_РЕЗ = неопределено;

	//Для каждого ВыборкаДетальныеЗаписи из ТЗспецификаций цикл
		//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		
		//сч = сч + 1;
		
		Основная = 0;
		//Основная = 0; //Плановая
		
		
		ДатаПланирования = КонецДня(Объект.Дата);
		Количество = Объект.КоличествоПоСпец;
		Спецификация = Объект.Спецификация;
		////+ Количество уровней разузлования
		_СтруктураР = абс_Дистрибуция.Лео_РазузловатьНоменклатуру(Спецификация,Количество,1,Основная,ДатаПланирования);
		ТЗ_ИсходныеКомплектующие = _СтруктураР.ИсходныеКомплектующие;
		
		Если ТЗ_ИсходныеКомп_РЕЗ = неопределено тогда
			ТЗ_ИсходныеКомп_РЕЗ = ТЗ_ИсходныеКомплектующие.Скопировать();
			ТЗ_ИсходныеКомп_РЕЗ.Очистить();
			ТЗ_ИсходныеКомп_РЕЗ.колонки.Добавить("Продукция");
			ТЗ_ИсходныеКомп_РЕЗ.колонки.Добавить("ПродукцияКоличество");
			
		КонецЕсли;
		////- Количество уровней разузлования
		
		
		УровеньРазузлования = абс_Дистрибуция.Лео_ПолучитьКоличествоУровнейРазузлования(Спецификация,Количество,Основная,ДатаПланирования);
		
		//_СтруктураР = абс_Дистрибуция.Лео_РазузловатьНоменклатуру(Спецификация,Количество,УровеньРазузлования,Основная,ДатаПланирования);
		ТекущийУроверь=1;
		//Пока  ТекущийУроверь<= УровеньРазузлования   Цикл
		//Чернов Разузловние не учитывается еще один уровень
		_СтруктураР = абс_Дистрибуция.Лео_РазузловатьНоменклатуру(Спецификация,Количество,УровеньРазузлования+1,Основная,ДатаПланирования);
		
		
		ТекущийУроверь=ТекущийУроверь+1;	
		Для каждого стр из _СтруктураР.ВыходныеИзделия цикл
			
			//сообщить("********************");
			
			//сообщить(стр.Номенклатура);
			//сообщить(стр.Количество);
			//сообщить(стр.спецификация);
			сс = ТЗ_ИсходныеКомп_РЕЗ.Добавить();
			ЗаполнитьЗначенияСвойств(сс,стр);
			сс.Продукция = стр.Номенклатура;
			сс.ПродукцияКоличество = стр.Количество;
			сс.Спецификация = стр.Спецификация;
			
			
			
			//    конецЦикла;
			
		конецЦикла;
		
		//Для каждого стр из _СтруктураР.ИсходныеКомплектующие цикл
		//	Если стр.Разузлован тогда
		//		сс = ТЗ_ИсходныеКомп_РЕЗ.Добавить();
		//		ЗаполнитьЗначенияСвойств(сс,стр);
		//		сс.Продукция = ВыборкаДетальныеЗаписи.Номенклатура;
		//		сс.ПродукцияКоличество = ВыборкаДетальныеЗаписи.Количество;
		//		сс.Спецификация = ВыборкаДетальныеЗаписи.Спецификация;
		//	КонецЕсли;
		//КонецЦикла;
		
		//ОбработкаПрерыванияПользователя();
		
		//Состояние("обработано: " + сокрлп(сч) + " из " + сокрлп(кКол)); 
		
	//КонецЦикла;
	
	
	
	
	Если ТЗ_ИсходныеКомп_РЕЗ = неопределено тогда
		Сообщить("Не найдены спецификации для указанной продукции !");
		
	иначе	
		
		ТЗ_Прод = ТЗ_ИсходныеКомп_РЕЗ.Скопировать();
		ТЗ_Прод.Свернуть("Спецификация,Номенклатура,Продукция","ПродукцияКоличество,Количество");
		ТЗ_Прод.Колонки.Добавить("ПродукцияАртикул");
		ТЗ_Прод.Колонки.Добавить("НоменклатураАртикул");
		ТЗ_Прод.Колонки.Добавить("КоличествоЗаЕд");
		ТЗ_Прод.Колонки.Добавить("Цена");
		ТЗ_Прод.Колонки.Добавить("Ценапоследняя");
		
		ТЗ_Прод.Колонки.Добавить("ГруппаПродукция");
		ТЗ_Прод.Колонки.Добавить("ГруппаНоменклатура");
		ТЗ_Прод.Колонки.Добавить("ТехКарта",Новый ОписаниеТипов("СправочникСсылка.ТехнологическиеКартыПроизводства"));
		ТЗ_Прод.Колонки.Добавить("Должность");
		ТЗ_Прод.Колонки.Добавить("КоличествоЗаСмену");
		ТЗ_Прод.Колонки.Добавить("КоличествоТребуетсяпоНорме");
		ТЗ_Прод.Колонки.Добавить("ЧасовВсмене");
		ТЗ_Прод.Колонки.Добавить("ЧеловекВсмене");
		
		//ТЗ_Прод.Колонки.Добавить("Ценазачас");	
		
		
		
		
		
		Для каждого сс из ТЗ_Прод цикл 
			сс.ПродукцияАртикул    = сс.Продукция.Артикул;
			сс.НоменклатураАртикул = сс.Номенклатура.Артикул;
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТехнологическиеКартыСпецификацийПланированияСрезПоследних.ТехнологическаяКарта
			|ИЗ
			|	РегистрСведений.ТехнологическиеКартыСпецификацийПланирования.СрезПоследних КАК ТехнологическиеКартыСпецификацийПланированияСрезПоследних
			|ГДЕ
			|	ТехнологическиеКартыСпецификацийПланированияСрезПоследних.Спецификация = &Спецификация";
			
			Запрос.УстановитьПараметр("Спецификация", сс.Спецификация);
			Результат = Запрос.Выполнить();
			ВыборкаДетальныеЗаписи = Результат.Выбрать();
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				// Вставить обработку выборки ВыборкаДетальныеЗаписи
				сс.ТехКарта=ВыборкаДетальныеЗаписи.ТехнологическаяКарта;
			КонецЦикла;
			
		КонецЦикла;
		
		ТЗ_Прод_ТЕХ = ТЗ_Прод.Скопировать();
		ТЗ_Прод_ТЕХ.Очистить();
		
		Для каждого сс из ТЗ_Прод цикл 
			
			
			Для каждого ссс из сс.ТехКарта.Маршрут цикл		
				
				сссс = ТЗ_Прод_ТЕХ.Добавить();
				ЗаполнитьЗначенияСвойств(сссс,сс);
				
				сссс.ТехКарта = сс.ТехКарта;
				сссс.Должность=ссс.Должность;
				сссс.ЧеловекВсмене=ссс.Количество;
				// сссс.КоличествоТребуетсяпоНорме =ссс.Количество;
				
				сссс.КоличествоЗаСмену = сс.ТехКарта.ОбъемПартии;
				сссс.Количество = сссс.ПродукцияКоличество*ссс.Количество/сссс.КоличествоЗаСмену;
				//сссс.ЧасовВсмене = сс.ТехКарта.Смена.часов;           
				//сссс.ЧасовВсмене = 8;           
				Если сс.ТехКарта.ЗЛК тогда
					
				    сссс.ЧасовВсмене = Число(СокрЛП(Лев(сс.ТехКарта.Смена,2)));	
					
				Иначе	
					
					сссс.ЧасовВсмене = 8;           
					
				КонецЕсли;

				
				
				//ДатаПредыдущегоМесяца = КонецМесяца(ДобавитьМесяц(_ДатаКон,-1));
				//сс.Цена = РегистрыСведений.Лео_ПартияНоменклатуры.ПолучитьПоследнее(ДатаПредыдущегоМесяца,Новый Структура("Номенклатура",сс.Номенклатура)).Цена; 
				
				//Если сс.Цена = 0 тогда
				// сссс.Цена = абс_Дистрибуция.ПолучитьЦенуПоПрайсуЛеоНастройки(КонецДня(_ДатаКон),сссс.Номенклатура,"ПлановаяСебестоимость_ТипЦен");
				//Конецесли;
				
				//сссс.ЦенаПоследняя=получитьпоследнююцену(сс.Номенклатура,КонецДня(_ДатаКон));
				//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
				// Данный фрагмент построен конструктором.
				// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	Лео_стоимостьПереработчиковСрезПоследних.ЦенаБезНДС КАК Цена,
				|	Лео_стоимостьПереработчиковСрезПоследних.Контрагент,
				|	Лео_стоимостьПереработчиковСрезПоследних.Должность,
				|	Лео_стоимостьПереработчиковСрезПоследних.Смена
				|ИЗ
				|	РегистрСведений.Лео_стоимостьПереработчиков.СрезПоследних(&Дата, ) КАК Лео_стоимостьПереработчиковСрезПоследних
				|ГДЕ
				|	Лео_стоимостьПереработчиковСрезПоследних.ДолжностьПереработчика = &Должность
				|	И Лео_стоимостьПереработчиковСрезПоследних.Контрагент = &Контрагент
				|	И Лео_стоимостьПереработчиковСрезПоследних.Смена = &Смена";
				
				//{Катанович   // стоимость переработчиков меняется
				Запрос.УстановитьПараметр("Дата", ДатаПланирования);
                //Катанович}
				Запрос.УстановитьПараметр("Должность", сссс.Должность);
				Запрос.УстановитьПараметр("Смена", сс.ТехКарта.Смена);
				Запрос.УстановитьПараметр("Контрагент", ссс.Контрагент);
				
				
				
				Результат = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = Результат.Выбрать();
				
				_Маршрут = сс.ТехКарта.Маршрут.Выгрузить();
				_Маршрут.Свернуть("Контрагент,Должность");
				_Маршрут.Сортировать("Контрагент Убыв");
				
				
				
				
				// По контрагентам
				ЕстьКонтрагент = Ложь;
				Если _Маршрут.Количество() > 0 тогда
					ЕстьКонтрагент = Истина;
				КонецЕсли;	
					
					
					
				сссс.Цена = 0;	
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					// Вставить обработку выборки ВыборкаДетальныеЗаписи
					
								
					
					Если ЕстьКонтрагент тогда 
						
						мПоиска = _Маршрут.НайтиСтроки(Новый Структура("Контрагент,Должность",ВыборкаДетальныеЗаписи.Контрагент,ВыборкаДетальныеЗаписи.Должность));
						
						
						Если  мПоиска.Количество() > 0 тогда
							//ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Контрагент) и 
							//_Маршрут[0].Контрагент = ВыборкаДетальныеЗаписи.Контрагент 
							//тогда 
							сссс.Цена=ВыборкаДетальныеЗаписи.Цена;
							
						КонецЕсли;  
						
					иначе
						сссс.Цена=ВыборкаДетальныеЗаписи.Цена;
						
					КонецЕсли;
					
				КонецЦикла;
				
				
				
				
				
				
				
				//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
				
				
				
				
				
				
				
				
				
				Если сссс.ПродукцияКоличество > 0 тогда
					сссс.КоличествоЗаЕд = сссс.Количество/сссс.ПродукцияКоличество;
				КонецЕсли;
				
				сссс.ГруппаПродукция       = Объект.Продукция.ВидНоменклатуры;
				//сссс.ГруппаНоменклатура    = сссс.Номенклатура.ВидНоменклатуры;
				//КонецЦикла;
				
			КонецЦикла;
		КонецЦикла;
		КонецЕсли;
		
		возврат ТЗ_Прод_ТЕХ
		
КонецФункции	

&НаКлиенте
Процедура Сформировать(Команда)
	
	пСтавкаНДС = 1 + УчетНДС.ПолучитьСтавкуНДС(Объект.Продукция.СтавкаНДС)/100;
	
    ТабДокумент.Очистить();
	
	
	Макет = Документы.Лео_РасчетСебестоимостиПродукции.ПолучитьМакет("Макет");
	
	
	_ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок|Основное");
	_Обл_Производственные = Макет.ПолучитьОбласть("Обл_Производственные|Основное");
	_Обл_Коммерческие = Макет.ПолучитьОбласть("Обл_Коммерческие|Основное");
	_Обл_Операционные = Макет.ПолучитьОбласть("Обл_Операционные|Основное");
	_Обл_Цена = Макет.ПолучитьОбласть("Обл_Цена|Основное");
	
	
	_ОбластьЗаголовок.Параметры.Номенклатура = СокрЛП(Объект.Продукция);
	_ОбластьЗаголовок.Параметры.ДатаС = Формат(Объект.Дата,"ДФ=dd.MM.yyyy");
	_ОбластьЗаголовок.Параметры.Описание = СокрЛП(Объект.Описание);
	
	
	_ОбластьЗаголовок.Параметры.ВесШт = Справочники.ЕдиницыИзмерения.НайтиПоКоду(Объект.Продукция.ЕдиницаХраненияОстатков.Код).ВесНетто;
	
	
	сПроизРасходы = ПолучитьКоэффПроизводственныеРасходы();
	
	тКаналов = сПроизРасходы.ТЗ.Скопировать();
	тКаналов.Свернуть("Канал");
	
	
	сОбластей = Новый Структура;
	
	сч = 0;
	Для каждого кк из тКаналов цикл 
		
	Если НЕ ЗначениеЗаполнено(кк.Канал) тогда продолжить конецесли;	
		
	Если 
		//НЕ ЗначениеЗаполнено(Объект._НаценкаПартнера) 
		//или	
		 НЕ ЗначениеЗаполнено(Объект._ЦенаРЦЦ) или
		 НЕ ЗначениеЗаполнено(Объект._ЦенаПромоНаПолке) тогда
		 ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заполните цены !!!");
		 Продолжить;
	КонецЕсли;	 
		
	сч = сч + 1;
	
	_Выводить = Истина;
	Если ЭтаФорма["Канал"+Строка(сч)] тогда
	иначе 
	_Выводить = Ложь;	
	КонецЕсли;	
	
	ПродукцияТорговаяМарка = ПолучитьСвойствоОбъекта(Объект.Продукция,ПланыВидовХарактеристик.СвойстваОбъектов.ТорговаяМарка);
	ПродукцияБрендPR = ПолучитьСвойствоОбъекта(Объект.Продукция,ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("00000000301"));//Бренд PR
	
	
	_сПроизРасходы = сПроизРасходы.ТЗ.НайтиСтроки(Новый Структура("Канал",кк.Канал));
	_сКоэфф = Новый Структура;
	
	_сКоэфф.Вставить("PRбренд",0);
	
	Для каждого ккк из _сПроизРасходы цикл
		
		Если ккк.сКод = "PRбренд" тогда
			//Если ккк.ТорговаяМарка = ПродукцияТорговаяМарка тогда		
			Если ВРег(ккк.Бренд) = ВРег(ПродукцияБрендPR) тогда		
				_сКоэфф.Вставить(ккк.сКод,ккк.Коэффициент);
			иначе
				продолжить;
			КонецЕсли; 
		иначе
			_сКоэфф.Вставить(ккк.сКод,ккк.Коэффициент);
		КонецЕсли;
		
	КонецЦикла;	
		
	_НаценкаПартнера = Объект["_НаценкаПартнера" + Строка(сч)];
		
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок|Канал_" + Строка(сч));
	Обл_Производственные = Макет.ПолучитьОбласть("Обл_Производственные|Канал_" + Строка(сч));
	Обл_Коммерческие = Макет.ПолучитьОбласть("Обл_Коммерческие|Канал_" + Строка(сч));
	Обл_Операционные = Макет.ПолучитьОбласть("Обл_Операционные|Канал_" + Строка(сч));
	Обл_Цена = Макет.ПолучитьОбласть("Обл_Цена|Канал_" + Строка(сч));
		
	ОбластьЗаголовок.Параметры.Канал = СокрЛП(кк.Канал);	
		
	
    //Производственные
	
	Обл_Производственные.Параметры.Сырье = Объект.ПланЦенаМатериалы;
	Обл_Производственные.Параметры.Упаковка = Объект.ПланЦенаУпаковка;
	Обл_Производственные.Параметры.Комплектующие = Объект.ПланЦенаКомплектуюшие;
	
		
	ФОТ = окр(Объект.ТабФОТ.Итог("СуммаПлан")/1000,2);
	Обл_Производственные.Параметры.ФОТ =  ФОТ * сПроизРасходы.ТрудовойКоэфф;
	
	Обл_Производственные.Параметры.МатРасходы = Объект.ПланЦенаМатЗатраты;
	
	
	//ОПР,КОММ,ЛОГ
	
	
	База = Объект.ПланЦенаМатЗатраты + ФОТ * сПроизРасходы.ТрудовойКоэфф;
	
	
	
	Обл_Производственные.Параметры.ОПР 			= ОКР(База * _сКоэфф.ОПР/100,2);
	Обл_Производственные.Параметры.Логистика 	= ОКР(База * _сКоэфф.ЛОГ/100,2);
	Обл_Производственные.Параметры.Коммунальные = ОКР(База * _сКоэфф.КОММ/100,2);
	
	
	//Обл_Производственные.Параметры.Расходы = Объект.ПланЦенаМатЗатраты + ФОТ + База * сПроизРасходы.ОПР/100 + База * сПроизРасходы.ЛОГ/100 + База * сПроизРасходы.КОММ/100;
	
	ПроизводственныеРасходы = Объект.ПланЦенаМатЗатраты + ФОТ * сПроизРасходы.ТрудовойКоэфф + ОКР(База * _сКоэфф.ОПР/100,2) + ОКР(База * _сКоэфф.ЛОГ/100,2)
	+ ОКР(База * _сКоэфф.КОММ/100,2);
	Обл_Производственные.Параметры.ПроизводственныеРасходы = ПроизводственныеРасходы;

	
	
	//ТабДокумент.Вывести(Обл_Производственные);
	
	//Коммерческие
	
	
	Цена_Отгрузки_БезНДС 	= Окр((Объект._ЦенаРЦЦ/(1 + _НаценкаПартнера/100))/пСтавкаНДС,2);
	
	Обл_Коммерческие.Параметры.ТМА 	    		= ОКР(Цена_Отгрузки_БезНДС * _сКоэфф.ТМА/100,2);
	Обл_Коммерческие.Параметры.Ретро 			= ОКР(Цена_Отгрузки_БезНДС * _сКоэфф.Ретро/100,2);
	Обл_Коммерческие.Параметры.ПремииНепрямым 	= ОКР(Цена_Отгрузки_БезНДС * _сКоэфф.ПрНЕП/100,2);
	Обл_Коммерческие.Параметры.Транспорт 		= ОКР(Цена_Отгрузки_БезНДС * _сКоэфф.Транспорт/100,2);
	Обл_Коммерческие.Параметры.ФОТ_КС 			= ОКР(Цена_Отгрузки_БезНДС * _сКоэфф.ФОТ_КС/100,2);
	
	КоммерческмеРасходы = ОКР(Цена_Отгрузки_БезНДС * _сКоэфф.ТМА/100,2) + ОКР(Цена_Отгрузки_БезНДС * _сКоэфф.Ретро/100,2)
	+ ОКР(Цена_Отгрузки_БезНДС * _сКоэфф.ПрНЕП/100,2) + ОКР(Цена_Отгрузки_БезНДС * _сКоэфф.Транспорт/100,2)
	+ ОКР(Цена_Отгрузки_БезНДС * _сКоэфф.ФОТ_КС/100,2);
	
	Обл_Коммерческие.Параметры.КоммерческмеРасходы = КоммерческмеРасходы;
	
	Обл_Коммерческие.Параметры.МаржинальныйДоход = Цена_Отгрузки_БезНДС - ПроизводственныеРасходы  - КоммерческмеРасходы;
	Обл_Коммерческие.Параметры.МаржинальнаяРентабельность = Окр((Цена_Отгрузки_БезНДС - ПроизводственныеРасходы  - КоммерческмеРасходы)/Цена_Отгрузки_БезНДС*100,1);
	
	
	//ТабДокумент.Вывести(Обл_Коммерческие);
	
	
	//Операционные
	
	
	//ПроизводственныеРасходы = Объект.ПланЦенаМатЗатраты + ФОТ;
	
	Обл_Операционные.Параметры.ФОТ_СВ 	    		= ОКР(ПроизводственныеРасходы * _сКоэфф.ФОТ_СВ/100,2);
	Обл_Операционные.Параметры.ПрочиеКомм 			= ОКР(ПроизводственныеРасходы * _сКоэфф.Прочие_Ком/100,2);
	Обл_Операционные.Параметры.НакладныеРасходы 	= ОКР(ПроизводственныеРасходы * _сКоэфф.НакладРасх/100,2);
	Обл_Операционные.Параметры.PRобщ 				= ОКР(ПроизводственныеРасходы * _сКоэфф.PRобщ/100,2);
	Обл_Операционные.Параметры.PR_Бренд 			= ОКР(Цена_Отгрузки_БезНДС * _сКоэфф.PRбренд/100,2);
	
	ОперационныеРасходы =  ОКР(ПроизводственныеРасходы * _сКоэфф.ФОТ_СВ/100,2) + ОКР(ПроизводственныеРасходы * _сКоэфф.Прочие_Ком/100,2)
	+ ОКР(ПроизводственныеРасходы * _сКоэфф.НакладРасх/100,2) + ОКР(ПроизводственныеРасходы * _сКоэфф.PRобщ/100,2);
	
	Обл_Операционные.Параметры.ОперационныеРасходы =  ОперационныеРасходы;
	
	_Резерв = 0;
	Если Цена_Отгрузки_БезНДС * (_сКоэфф.PRбренд/100) = 0 тогда
	_Резерв = ПроизводственныеРасходы * _сКоэфф.Резерв/100;
	КонецЕсли;
	Обл_Операционные.Параметры.Резерв = _Резерв;
	
	
	
	
	//ТабДокумент.Вывести(Обл_Операционные);
	
	Обл_Производственные.Параметры.Расходы = ПроизводственныеРасходы + КоммерческмеРасходы + ОперационныеРасходы
	+ ОКР(Цена_Отгрузки_БезНДС * _сКоэфф.PRбренд/100,2) + _Резерв;
	
	
	
	// Цена
	
	Обл_Цена.Параметры.Цена_РЦЦ 	    = Объект._ЦенаРЦЦ;
	Обл_Цена.Параметры.Цена_РЦЦ_БезНДС 	= Окр(Объект._ЦенаРЦЦ/пСтавкаНДС,2);
	
	
	
	Обл_Цена.Параметры.Цена_Промо 	    = Объект._ЦенаПромоНаПолке;
	Обл_Цена.Параметры.Цена_Промо_БезНДС 	= Окр(Объект._ЦенаПромоНаПолке/пСтавкаНДС,2);
	
	
	//Обл_Цена.Параметры.Наценка_Процент 	    = Объект._НаценкаПартнера;
	
	//_НаценкаПартнера = Объект._НаценкаПартнера + Строка(сч);
	Обл_Цена.Параметры.Наценка_Процент 	    = _НаценкаПартнера;
	
	Обл_Цена.Параметры.Цена_РПЛ 	    = Окр((Объект._ЦенаРЦЦ/(1+_НаценкаПартнера/100))/(1+_сКоэфф.Статус/100),2);
	
	Цена_РПЛ_БезНДС = Окр((Объект._ЦенаРЦЦ/(1+_НаценкаПартнера/100))/пСтавкаНДС/(1+_сКоэфф.Статус/100),2);
	
	Обл_Цена.Параметры.Цена_РПЛ_БезНДС 	= ОкруглитьДо10Копеек(Цена_РПЛ_БезНДС);
	
	
	
	Обл_Цена.Параметры.Цена_Отгрузки 	    = Окр(Объект._ЦенаРЦЦ/(1+_НаценкаПартнера/100),2);
	Обл_Цена.Параметры.Цена_Отгрузки_БезНДС 	= Окр((Объект._ЦенаРЦЦ/(1+_НаценкаПартнера/100))/пСтавкаНДС,2);
	
	
	Обл_Цена.Параметры.Цена_ОтгрузкиПромо 	    = Окр(Объект._ЦенаПромоНаПолке/(1+_НаценкаПартнера/100),2);
	Обл_Цена.Параметры.Цена_ОтгрузкиПромо_БезНДС 	= Окр((Объект._ЦенаПромоНаПолке/(1+_НаценкаПартнера/100))/пСтавкаНДС,2);
	
	Обл_Цена.Параметры.Цена_Промо_Процент = Окр((Окр((Объект._ЦенаПромоНаПолке/(1+_НаценкаПартнера/100))/пСтавкаНДС,2)/
	                                        Окр((Объект._ЦенаРЦЦ/(1+_НаценкаПартнера/100))/пСтавкаНДС,2) - 1) * 100,0);
	
	Обл_Цена.Параметры.ПрибыльМаржинальная = Цена_Отгрузки_БезНДС - ПроизводственныеРасходы - КоммерческмеРасходы;
	
	Обл_Цена.Параметры.ПрибыльБренд = Цена_Отгрузки_БезНДС - ПроизводственныеРасходы - КоммерческмеРасходы - ОперационныеРасходы - ОКР(Цена_Отгрузки_БезНДС * _сКоэфф.PRбренд/100,2)
	//+ Цена_Отгрузки_БезНДС * (_сКоэфф.PRбренд/100);
	+ ОКР(Цена_Отгрузки_БезНДС * _сКоэфф.PRбренд/100,2); 

	Обл_Цена.Параметры.ПрибыльДоНалог = Цена_Отгрузки_БезНДС - ПроизводственныеРасходы - КоммерческмеРасходы - ОперационныеРасходы - ОКР(Цена_Отгрузки_БезНДС * _сКоэфф.PRбренд/100,2)
	 - _Резерв;
	
	// Рентабельность
	
	Обл_Цена.Параметры.РЦЦ_Рентабельность = Окр((Цена_Отгрузки_БезНДС - ПроизводственныеРасходы - КоммерческмеРасходы - ОперационныеРасходы)/Цена_Отгрузки_БезНДС*100,0);
	
	Обл_Цена.Параметры.Промо_Рентабельность = Окр((Окр((Объект._ЦенаПромоНаПолке/(1+_НаценкаПартнера/100))/пСтавкаНДС,2) 
	- ПроизводственныеРасходы - КоммерческмеРасходы - ОперационныеРасходы + Цена_Отгрузки_БезНДС * (_сКоэфф.ТМА/100))
	/ Окр((Объект._ЦенаПромоНаПолке/(1+_НаценкаПартнера/100))/пСтавкаНДС,2)*100,0);
	
	
	// ставка НДС 
	Обл_Цена.Параметры.СтавкаНДС = СокрЛП(Объект.Продукция.СтавкаНДС);
	
	///////////////////////////////////////////////////
	//ТабДокумент.Присоединить(ОбластьЗаголовок);
	//ТабДокумент.Присоединить(Обл_Производственные);
	//ТабДокумент.Присоединить(Обл_Коммерческие);
	//ТабДокумент.Присоединить(Обл_Операционные);
	//ТабДокумент.Присоединить(Обл_Цена);
	

	сОбластей.Вставить("ОбластьЗаголовок" + Строка(сч),ОбластьЗаголовок);
	сОбластей.Вставить("Обл_Производственные" + Строка(сч),Обл_Производственные);
	сОбластей.Вставить("Обл_Коммерческие" + Строка(сч),Обл_Коммерческие);
	сОбластей.Вставить("Обл_Операционные" + Строка(сч),Обл_Операционные);
	сОбластей.Вставить("Обл_Цена" + Строка(сч),Обл_Цена);
	
	сОбластей.Вставить("Выводить" + Строка(сч),_Выводить);
	
	
    КонецЦикла;

	
	//ТабДокумент.Вывести(_ОбластьЗаголовок);
	//ТабДокумент.Вывести(_Обл_Производственные);
	//ТабДокумент.Вывести(_Обл_Коммерческие);
	//ТабДокумент.Вывести(_Обл_Операционные);
	//ТабДокумент.Вывести(_Обл_Цена);
	
	
	ТабДокумент.Вывести(_ОбластьЗаголовок);
	Для  тт = 1 по сч цикл     
		Если сОбластей["Выводить"+Строка(тт)] тогда
		ТабДокумент.Присоединить(сОбластей["ОбластьЗаголовок"+Строка(тт)]);
		Конецесли;
    КонецЦикла;

	ТабДокумент.Вывести(_Обл_Производственные);
	Для  тт = 1 по сч цикл       
		Если сОбластей["Выводить"+Строка(тт)] тогда
		ТабДокумент.Присоединить(сОбластей["Обл_Производственные"+Строка(тт)]);
		Конецесли;
    КонецЦикла;
	
	ТабДокумент.Вывести(_Обл_Коммерческие);
	Для  тт = 1 по сч цикл    
		Если сОбластей["Выводить"+Строка(тт)] тогда
		ТабДокумент.Присоединить(сОбластей["Обл_Коммерческие"+Строка(тт)]);
		Конецесли;
    КонецЦикла;
	
	ТабДокумент.Вывести(_Обл_Операционные);
	Для  тт = 1 по сч цикл   
		Если сОбластей["Выводить"+Строка(тт)] тогда
		ТабДокумент.Присоединить(сОбластей["Обл_Операционные"+Строка(тт)]);
		Конецесли;
    КонецЦикла;

	ТабДокумент.Вывести(_Обл_Цена);
	Для  тт = 1 по сч цикл  
		Если сОбластей["Выводить"+Строка(тт)] тогда
		ТабДокумент.Присоединить(сОбластей["Обл_Цена"+Строка(тт)]);
		Конецесли;
    КонецЦикла;
	
	
	
	ТабДокумент.ОтображатьСетку = Истина;
	ТабДокумент.ОриентацияСтраницы=ОриентацияСтраницы.Портрет;

	ТабДокумент.Показать();
		
		
		
		
		
КонецПроцедуры
	

Функция ОкруглитьДо10Копеек(Цена_РПЛ_БезНДС)
	
	
	ЦелаяЧасть   = Цел(Цена_РПЛ_БезНДС);
	ДробнаяЧасть = Цена_РПЛ_БезНДС - ЦелаяЧасть;
	
	Если ДробнаяЧасть < 0.10 тогда
	   Цена_РПЛ_БезНДС = ЦелаяЧасть + 0.10; 
    КонецЕсли;
   
    возврат Цена_РПЛ_БезНДС;
	
КонецФункции	


Функция ПолучитьСвойствоОбъекта(Продукция,Свойство)

	ЗнСвойства = Справочники.ЗначенияСвойствОбъектов.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Объект,
	|	ЗначенияСвойствОбъектов.Свойство,
	|	ЗначенияСвойствОбъектов.Значение
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Объект = &Объект
	|	И ЗначенияСвойствОбъектов.Свойство = &Свойство";
	
	Запрос.УстановитьПараметр("Объект", Продукция);
	Запрос.УстановитьПараметр("Свойство", Свойство);
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() тогда
		
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		ЗнСвойства = ВыборкаДетальныеЗаписи.Значение;
		
	КонецЕсли;
	
	возврат ЗнСвойства;
	
КонецФункции


&НаСервере
Процедура СформироватьНаСервере()
		// Вставить содержимое обработчика.
		        
КонецПроцедуры



Функция ПолучитьКоэффПроизводственныеРасходы()

	 скоэфф = Новый Структура;
	 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лео_СтатьиРасходов.Ссылка как СтатьяРасходов,
		|	Лео_СтатьиРасходов.сКод
		|ИЗ
		|	Справочник.Лео_СтатьиРасходов КАК Лео_СтатьиРасходов
		|ГДЕ
		|	НЕ Лео_СтатьиРасходов.ЭтоГруппа";

	
	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();
    сОбкоэфф = Новый Соответствие;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		 сОбкоэфф.Вставить(ВыборкаДетальныеЗаписи.СтатьяРасходов,ВыборкаДетальныеЗаписи.СтатьяРасходов);
	КонецЦикла;

	 
	 //////////////////////////////////////////////////////////////////////////////////////
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лео_СтатьиРасходовКоэффициентСрезПоследних.Период,
		|	Лео_СтатьиРасходовКоэффициентСрезПоследних.Канал,
		|	Лео_СтатьиРасходовКоэффициентСрезПоследних.СтатьяРасходов,
		|	Лео_СтатьиРасходовКоэффициентСрезПоследних.СтатьяРасходов.сКод как сКод,
		|	Лео_СтатьиРасходовКоэффициентСрезПоследних.Бренд,
		|	Лео_СтатьиРасходовКоэффициентСрезПоследних.ТорговаяМарка как ТорговаяМарка,
		|	Лео_СтатьиРасходовКоэффициентСрезПоследних.Коэффициент
		|ИЗ
		|	РегистрСведений.Лео_СтатьиРасходовКоэффициент.СрезПоследних(&ДатаКон, ) КАК Лео_СтатьиРасходовКоэффициентСрезПоследних";

	Запрос.УстановитьПараметр("ДатаКон", ?(ЗначениеЗаполнено(Объект.Дата),КонецДня(Объект.Дата),КонецДня(ТекущаяДата())));

	Результат = Запрос.Выполнить();

	ТЗкоэфф = Результат.Выгрузить();
	ТЗканал = ТЗкоэфф.Скопировать();
	ТЗканал.Свернуть("Канал");
	Для каждого кк из ТЗканал цикл 
		Если ЗначениеЗаполнено(кк.Канал) тогда
		   Для каждого оо из сОбкоэфф цикл
			   мПоиска = ТЗкоэфф.НайтиСтроки(Новый Структура("Канал,СтатьяРасходов",кк.Канал,оо.Ключ));
			   Если мПоиска.Количество() = 0 тогда
			   рр = ТЗкоэфф.Добавить();
			   рр.Период = Дата(1,1,1);
			   рр.Канал = кк.Канал;
			   рр.СтатьяРасходов = оо.Значение;
			   рр.сКод = оо.Значение.сКод;
			   рр.Бренд = Справочники.Лео_Бренды.ПустаяСсылка();
			   рр.ТорговаяМарка = Справочники.ЗначенияСвойствОбъектов.ПустаяСсылка();
			   рр.Коэффициент = 0;
		       КонецЕсли;
		   КонецЦикла;	
		КонецЕсли;
	КонецЦикла;	
	
	скоэфф.Вставить("ТЗ",ТЗкоэфф); 
	 
	 ткоэфф = РегистрыСведений.Лео_ТрудовойКоэффициент.ПолучитьПоследнее(КонецДня(Объект.Дата));
	 скоэфф.Вставить("ТрудовойКоэфф",ткоэфф.Коэффициент);
	 Возврат скоэфф
	
КонецФункции	


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	сПроизРасходы = ПолучитьКоэффПроизводственныеРасходы();
	
	тКаналов = сПроизРасходы.ТЗ.Скопировать();
	тКаналов.Свернуть("Канал");
	
	
    ДобавляемыеРеквизиты = Новый Массив; //Определяем массив добавляемых реквизитов	
	сч = 0;
	Для каждого кк из тКаналов цикл 
		Если НЕ ЗначениеЗаполнено(кк.Канал) тогда 
			продолжить 
		конецесли;		
	сч = сч + 1;
	
	НовыйРеквизит = Новый РеквизитФормы("Канал"+Строка(сч),Новый ОписаниеТипов("Булево")); 
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы("_НаценкаПартнера"+Строка(сч),Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,2))); 
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	КонецЦикла;
	
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты); //Применяем реквизиты 	
	
	
   //Пример создания обычной группы
	ГруппаКанал = ЭтаФорма.Элементы.Добавить("ГруппаКанал", Тип("ГруппаФормы"),ЭтаФорма.Элементы.Группа6);
	ГруппаКанал.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаКанал.Заголовок = "Каналы";
	ГруппаКанал.Отображение = ОтображениеОбычнойГруппы.Линия;
	ГруппаКанал.ОтображатьЗаголовок = ИСТИНА; 
	ГруппаКанал.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
	ГруппаКанал.РастягиватьПоГоризонтали = ИСТИНА;	
	
   //ГруппаНаценка
	ГруппаНаценка = ЭтаФорма.Элементы.Добавить("ГруппаНаценка", Тип("ГруппаФормы"),ЭтаФорма.Элементы.Группа6);
	ГруппаНаценка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаНаценка.Заголовок = "Наценка Партнера";
	ГруппаНаценка.Отображение = ОтображениеОбычнойГруппы.Линия;
	ГруппаНаценка.ОтображатьЗаголовок = ИСТИНА; 
	ГруппаНаценка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
	ГруппаНаценка.РастягиватьПоГоризонтали = ИСТИНА;	
	
	
	
	сч = 0;
	Для каждого кк из тКаналов цикл 
	Если НЕ ЗначениеЗаполнено(кк.Канал) тогда продолжить конецесли;	
		
	сч = сч + 1;
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("Канал"+Строка(сч), Тип("ПолеФормы"),ГруппаКанал);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "Канал"+Строка(сч);	
	
	ЭтаФорма["Канал"+Строка(сч)] = Истина;
	
	///////////////////////////////////////////////////////
	
	
	НовыйЭлемент_1 = ЭтаФорма.Элементы.Добавить("_НаценкаПартнера"+Строка(сч), Тип("ПолеФормы"),ГруппаНаценка);
	НовыйЭлемент_1.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент_1.ПутьКДанным = "Объект._НаценкаПартнера"+Строка(сч);
	НовыйЭлемент_1.Заголовок = "Наценка"+Строка(сч);
	НовыйЭлемент_1.Ширина = 8;
	
	
	Если Объект["_НаценкаПартнера" + Строка(сч)] = 0 тогда
		
		мПоиска = сПроизРасходы.ТЗ.НайтиСтроки(Новый Структура("Канал,сКод",кк.Канал,"Наценка"));
		Если мПоиска.Количество() > 0 тогда
		Объект["_НаценкаПартнера" + Строка(сч)] = мПоиска[0].Коэффициент;
		КонецЕсли;
		
	
	КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабМатЗатратыЦенаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ПересчитатьСуммаПлан();
	
КонецПроцедуры

&НаКлиенте
Процедура ТабМатЗатратыКоличествоПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ПересчитатьСуммаПлан();	
	
КонецПроцедуры

 
&НаКлиенте
Процедура ПересчитатьСуммаПлан()
	// Вставить содержимое обработчика.
	
  ТекущийЭлемент.ТекущиеДанные.СуммаПлан = ТекущийЭлемент.ТекущиеДанные.ЦенаПлан * ТекущийЭлемент.ТекущиеДанные.Количество;
	
	
  Объект.ПланЦенаМатЗатраты = Объект.ТабМатЗатраты.Итог("СуммаПлан");
  
  Объект.ПланЦенаМатериалы = 0;
  Объект.ПланЦенаУпаковка = 0;
  Объект.ПланЦенаКомплектуюшие = 0;
  
		Для каждого сс из Объект.ТабМатЗатраты цикл
			Если СокрЛП(сс.ВидНоменклатуры) = "Материал" тогда
				Объект.ПланЦенаМатериалы = Объект.ПланЦенаМатериалы + сс.СуммаПлан;
			иначеЕсли СокрЛП(сс.ВидНоменклатуры) = "Упаковка" тогда
				Объект.ПланЦенаУпаковка = Объект.ПланЦенаУпаковка + сс.СуммаПлан;
			иначе
				Объект.ПланЦенаКомплектуюшие = Объект.ПланЦенаКомплектуюшие + сс.СуммаПлан;
			КонецЕсли;
		КонецЦикла;
  
 КонецПроцедуры
	

&НаКлиенте
Процедура ТабФОТЦенаПриИзменении(Элемент)

	ТекущийЭлемент.ТекущиеДанные.СуммаПлан = ТекущийЭлемент.ТекущиеДанные.Цена * ТекущийЭлемент.ТекущиеДанные.Количество * ТекущийЭлемент.ТекущиеДанные.ЧасовВсмене;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
 
	Если Объект.Ответственный.Пустая() Тогда
		Объект.Ответственный = глЗначениеПеременной("глТекущийПользователь");
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура СпецификацияНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	ТЗспец = ПолучитьАктуальнуюСпецификациюСервер();
	Элемент.СписокВыбора.Очистить();

	Для Каждого Строка из ТЗспец Цикл
		Если ЗначениеЗаполнено(Строка.СпецификацияПлан) Тогда
		    СпецификацияСсылка =  Строка.СпецификацияПлан;
		Иначе
			СпецификацияСсылка  =  Строка.СпецификацияОсн;
		КонецЕсли;
		ЭлеменСписка = Элемент.СписокВыбора.НайтиПоЗначению(СпецификацияСсылка);
		Если  ЭлеменСписка = Неопределено Тогда 
	          Элемент.СписокВыбора.Добавить(СпецификацияСсылка);
		КонецЕсли;	  
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
		ПолучитьАктуальнуюСпецификациюСервер(); 
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияПриИзменении(Элемент)
		ПолучитьАктуальнуюСпецификациюСервер(); 
КонецПроцедуры
